-------------------------------------------------------------------
-- Примеры кода к главе                                          --
--                                                               --
-- Для вашего удобства все примеры вынесены в единственный файл. --
-- Раскомментируйте какую-то *ОДНУ* из секций - и в путь!        --
-------------------------------------------------------------------
-------------------------------------------------------------------

simpleSum :: Int -> Int
simpleSum value = value + value

main = putStrLn (show (simpleSum 4))

-------------------------------------------------------------------
-------------------------------------------------------------------
{-
indicate :: String -> String
indicate address = 
    if address == "127.0.0.1" then "localhost" else address

main = putStrLn (indicate "127.0.0.1")
-}
-------------------------------------------------------------------
-------------------------------------------------------------------
{-
indicate :: String -> String
indicate address 
    | address == "127.0.0.1" = "localhost" 
    | null address = "empty IP-address" 
    | otherwise = address

main = putStrLn (indicate "127.0.0.1")
-}
-------------------------------------------------------------------
-------------------------------------------------------------------
{-
prepareLength :: Double -> Double
prepareLength line = 
    line * coefficient
    where coefficient = 0.4959

main = putStrLn (show (prepareLength 4.56))
-}
-------------------------------------------------------------------
-------------------------------------------------------------------
{-
prepareLength :: Double -> Double
prepareLength line = 
    let coefficient = 12.4959
        correction = 0.0012
    in
    line * coefficient - correction

main = putStrLn (show (prepareLength 4.56))
-}
-------------------------------------------------------------------
-------------------------------------------------------------------

