-------------------------------------------------------------------
-- Примеры кода к главе                                          --
--                                                               --
-- Для вашего удобства все примеры вынесены в единственный файл. --
-- Раскомментируйте какую-то *ОДНУ* из секций - и в путь!        --
-------------------------------------------------------------------
-------------------------------------------------------------------

chessMove :: (String, String) -> String
chessMove pair = fst pair ++ "-" ++ snd pair
 
main = print $ chessMove ("e2", "e4")

-------------------------------------------------------------------
-------------------------------------------------------------------
{-
get1 (element, _, _, _) = element
get2 (_, element, _, _) = element
get3 (_, _, element, _) = element
get4 (_, _, _, element) = element

main = print $ get3 ("One", "Two", "Three", "Four")
-}
-------------------------------------------------------------------
-------------------------------------------------------------------
{-
import Data.Tuple.Select
 
main = print $ sel3 ("One", "Two", "Three", "Four")
-}
-------------------------------------------------------------------
-------------------------------------------------------------------
