-------------------------------------------------------------------
-- Примеры кода к главе                                          --
--                                                               --
-- Для вашего удобства все примеры вынесены в единственный файл. --
-- Раскомментируйте какую-то *ОДНУ* из секций - и в путь!        --
-------------------------------------------------------------------
-------------------------------------------------------------------

module Main where

makeListFrom :: a -> Int -> [a]  
makeListFrom value howMany = 
    if howMany > 0 
    then value : makeListFrom value (howMany - 1)
    else []

main :: IO ()
main = print $ makeListFrom 2 3

-------------------------------------------------------------------
-------------------------------------------------------------------
